Revit 2027 API
RebarShapeConstraintRadius Class
 A radius constraint associated with an arc in a RebarShapeDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintRadius : RebarShapeConstraint
Public Class RebarShapeConstraintRadius
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintRadius : public RebarShapeConstraint
type RebarShapeConstraintRadius =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintRadius type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintRadius |  Create a radius constraint.
Top
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the radius.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace